tap "oven-sh/bun"
tap "remove-bg/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "imagemagick"
# Pager program similar to more
brew "less"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc"
# Interactive cheatsheet tool for the command-line
brew "neofetch"
# Shell command parallelization utility
brew "parallel"
# General-purpose scripting language
brew "php"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Utility that provides fast incremental file transfer
brew "rsync"
# Simplified and community-driven man pages
brew "tldr"
# CLI tool that moves files or folder to the trash
brew "trash"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Remove image background - 100% automatically
brew "remove-bg/tap/removebg"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-open-sans"
# Grammarly for desktop
cask "grammarly-desktop"
# Software for Logitech devices
cask "logi-options+"
# Trims video and audio files losslessly
cask "losslesscut"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Open-source software for live streaming and screen recording
cask "obs"
# Desktop virtualization software
cask "parallels"
# Screen measuring tool
cask "pixelsnap"
# Environment for statistical computing and graphics
cask "r"
# Window snapping tool
cask "rectangle-pro"
# Data science software focusing on R and Python
cask "rstudio"
# Music streaming service
cask "spotify"
# Quicklook extension for source files
cask "syntax-highlight"
# Open-source code editor
cask "visual-studio-code"
# Virtual machine client
cask "vmware-horizon-client"
